###  Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

###  Step 2. Import the dataset drinks.csv

In [2]:
df = pd.read_csv('drinks.csv')

###  Step 3. Assign it to a variable called drinks.

In [3]:
drinks = df

In [4]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [5]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

###   Step 4. Which continent drinks more beer on average?

In [11]:
drinks['continent'].unique()

array(['AS', 'EU', 'AF', nan, 'SA', 'OC'], dtype=object)

In [18]:
data2 = drinks.groupby('continent')['beer_servings'].agg(np.mean).sort_values(ascending=False)

In [19]:
data2

continent
EU    193.777778
SA    175.083333
OC     89.687500
AF     61.471698
AS     37.045455
Name: beer_servings, dtype: float64

In [20]:
print('Continent which drinks more beer on Average: EU')

Continent which drinks more beer on Average: EU

###  Step 5. For each continent print the statistics for wine consumption.

In [21]:
data3 = drinks.groupby('continent')['wine_servings'].agg([np.max, np.min, np.sum, np.mean])

In [22]:
data3

           amax  amin   sum        mean
continent
AF          233     0   862   16.264151
AS          123     0   399    9.068182
EU          370     0  6400  142.222222
OC          212     0   570   35.625000
SA          221     1   749   62.416667

###  Step 6. Print the mean alcohol consumption per continent for every column

In [27]:
data4 = drinks.groupby('continent')['beer_servings','spirit_servings','wine_servings','total_litres_of_pure_alcohol'].agg([np.mean])

In [28]:
data4

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
,mean,mean,mean,mean
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

###  Step 7. Print the median alcohol consumption per continent for every column

In [29]:
data5 = drinks.groupby('continent')['beer_servings','spirit_servings','wine_servings','total_litres_of_pure_alcohol'].agg([np.median])

In [30]:
data5

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
,median,median,median,median
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

###   Step 8. Print the mean, min and max values for spirit consumption.

In [36]:
p = pd.DataFrame([drinks['spirit_servings'].mean(),drinks['spirit_servings'].min(),drinks['spirit_servings'].max()], 
                 index=['spirit_mean', 'spirit_min', 'spirit_max'],
                 columns=['values'])

In [37]:
p

                 values
spirit_mean   80.994819
spirit_min     0.000000
spirit_max   438.000000